# RebarSystemLayerSummaryBottomDir1NoSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemLayerSummaryBottomDir1NoSpacing Property
ParameterTypeId Class See Also
---
"Bottom/Interior Major (Brief)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemLayerSummaryBottomDir1NoSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemLayerSummaryBottomDir1NoSpacing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemLayerSummaryBottomDir1NoSpacing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace